In [1]:
!pip install Psycopg2

Requirement already satisfied: Psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
import pandas
import configparser
import psycopg2

In [3]:
config = configparser.ConfigParser()
config.read('config.ini')


host = config['myaws']['host']
user = config['myaws']['user']
pwd = config['myaws']['pswd']
database = config['myaws']['database']

In [4]:
conn = psycopg2.connect(
                        host = host,
                            user = user,
                            password = pwd,
                            dbname = database)

In [5]:
cur=conn.cursor()

In [6]:
sql_statement = '''
                select * from student_gp4
                '''

In [7]:
cur.execute(sql_statement)

In [8]:
cur.fetchone()

('charbrow@jmu.edu                                                                                    ',
 'Charlie brown\n                                                                                      ',
 'intelligence analysi')

# Q1

In [9]:
for result in cur.fetchall():
    print(result)

('jacwy@jmu.edu                                                                                       ', 'Jacey wyatt                                                                                         ', 'intelligence analysi')
('jimbo@jmu.edu                                                                                       ', 'Jim bob                                                                                             ', 'intelligence analysi')
('davcamp@jmu.edu                                                                                     ', 'David campora                                                                                       ', 'intelligence analysi')
('alyhad@jmu.edu                                                                                      ', 'Alyssa hadfield                                                                                     ', 'intelligence analysi')
('allstew@jmu.edu                                                                                     ', 'Allison stewart                                                                                     ', 'intelligence analysi')
('demo_email                                                                                          ', 'demo_name                                                                                           ', 'GS                  ')

In [10]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

,email,name,major
0,charbrow@jmu.edu ...,Charlie brown\n ...,intelligence analysi
1,jacwy@jmu.edu ...,Jacey wyatt ...,intelligence analysi
2,jimbo@jmu.edu ...,Jim bob ...,intelligence analysi
3,davcamp@jmu.edu ...,David campora ...,intelligence analysi
4,alyhad@jmu.edu ...,Alyssa hadfield ...,intelligence analysi
5,allstew@jmu.edu ...,Allison stewart ...,intelligence analysi
6,demo_email ...,demo_name ...,GS

In [11]:
df.describe()

,email,name,major
count,7,7,7
unique,7,7,2
top,charbrow@jmu.edu ...,Allison stewart ...,intelligence analysi
freq,1,1,6

# Q2

In [12]:
sql_statement = '''
                select cname, count(semail) from enroll_gp4 group by cname
                order by count(semail) desc
                limit 1
                '''

In [13]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

                                               cname  count
0  ia460                                         ...      2

# Q3

In [14]:
sql_statement = '''
                select 
                *
                from teacher_gp4
                inner join course_gp4
                on teacher_gp4.email = course_gp4.temail
                '''

In [15]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

,email,name,office,name,room,temail
0,waltontr@jmu.edu ...,timothy walton ...,isat326,ia460 ...,1204,waltontr@jmu.edu ...
1,waltontr@jmu.edu ...,timothy walton ...,isat326,ia200 ...,1209,waltontr@jmu.edu ...
2,weixx@jmu.edu ...,xeubin wei ...,hhs112,ia241 ...,2010,weixx@jmu.edu ...
3,teateaa@jmu.edu ...,anthony teate ...,isat126,ia341 ...,1202,teateaa@jmu.edu ...
4,waltontr@jmu.edu ...,timothy walton ...,isat326,ia214 ...,1204,waltontr@jmu.edu ...
5,benfranklin@jmu.edu ...,ben franklin ...,isat 123,Econ 300 ...,Godwin 211,benfranklin@jmu.edu ...
6,benfranklin@jmu.edu ...,ben franklin ...,isat 123,econ 300 ...,isat 211,benfranklin@jmu.edu ...
7,benfranklin@jmu.edu ...,ben franklin ...,isat 123,ia210 ...,2202,benfranklin@jmu.edu ...
8,phil@jmu.edu ...,phil lewis ...,isat 123,ia 250 ...,2502,phil@jmu.edu ...

# Q4

In [16]:
sql_statement = '''
                select 
                teacher_gp4.name as tname,
                count (course_gp4.name) as course_num
                from teacher_gp4
                inner join course_gp4
                on teacher_gp4.email = course_gp4.temail
                group by teacher_gp4.name
                order by course_num desc
                limit 1
                '''

In [17]:
df = pandas.read_sql_query(sql_statement, conn)
df[:]

                                               tname  course_num
0  timothy walton                                ...           3

# Q5

In [18]:
sql_insert_statement = '''
                        insert into teacher_gp4(email,name,office)
                        values('{}','{}','{}')
                        '''.format('phil@jmu.edu','phil lewis', 'isat 123')
print(sql_insert_statement)

                        insert into teacher_gp4(email,name,office)
                        values('phil@jmu.edu','phil lewis','isat 123')

In [19]:
cur.execute(sql_insert_statement)

UniqueViolation: duplicate key value violates unique constraint "teacher_gp4_pkey"
DETAIL:  Key (email)=(phil@jmu.edu                                                                                        ) already exists.

In [ ]:
conn.commit()

In [ ]:
df = pandas.read_sql_query("select * from teacher_gp4", conn)
df[:]

In [ ]:
sql_insert_statement = '''
                        insert into course_gp4(name,room,temail)
                        values('{}','{}','{}')
                        '''.format('ia 250','2502', 'phil@jmu.edu')
print(sql_insert_statement)

In [ ]:
cur.execute(sql_insert_statement)

In [ ]:
conn.commit()

In [ ]:
df = pandas.read_sql_query("select * from course_gp4", conn)
df[:]

# Q6

In [24]:
sql_insert_statement =  '''
                        update course_gp4
                        set temail = 'phil@jmu.edu'
                        where temail = 'teateaa@jmu.edu'
                        '''

In [25]:
cur.execute(sql_insert_statement)

In [26]:
conn.commit()

In [27]:
df = pandas.read_sql_query("select * from course_gp4", conn)
df[:]

,name,room,temail
0,ia460 ...,1204,waltontr@jmu.edu ...
1,ia200 ...,1209,waltontr@jmu.edu ...
2,ia241 ...,2010,weixx@jmu.edu ...
3,ia214 ...,1204,waltontr@jmu.edu ...
4,Econ 300 ...,Godwin 211,benfranklin@jmu.edu ...
5,econ 300 ...,isat 211,benfranklin@jmu.edu ...
6,ia210 ...,2202,benfranklin@jmu.edu ...
7,ia 250 ...,2502,phil@jmu.edu ...
8,ia341 ...,1202,phil@jmu.edu ...

,email,name,office
0,weixx@jmu.edu ...,xeubin wei ...,hhs112
1,waltontr@jmu.edu ...,timothy walton ...,isat326
2,teateaa@jmu.edu ...,anthony teate ...,isat126
3,tangjd@jmu.edu\n ...,jeffrey tang ...,isat368
4,benfranklin@jmu.edu ...,ben franklin ...,isat 123
5,phil@jmu.edu ...,phil lewis ...,isat 123

In [28]:
sql_insert_statement =  '''
                        delete from teacher_gp4
                        where email = 'teateaa@jmu.edu'
                        '''

In [29]:
cur.execute(sql_insert_statement)

In [30]:
conn.commit()

In [31]:
df = pandas.read_sql_query("select * from teacher_gp4", conn)
df[:]

,email,name,office
0,weixx@jmu.edu ...,xeubin wei ...,hhs112
1,waltontr@jmu.edu ...,timothy walton ...,isat326
2,tangjd@jmu.edu\n ...,jeffrey tang ...,isat368
3,benfranklin@jmu.edu ...,ben franklin ...,isat 123
4,phil@jmu.edu ...,phil lewis ...,isat 123